app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "keep them coming"], ["post_id", 4], ["created_at", "2015-05-17 22:36:00.553611"], ["updated_at", "2015-05-17 22:36:00.553611"]]